ideas : https://www.dezyre.com/article/top-10-machine-learning-projects-for-beginners/397
https://trade.cites.org/en/cites_trade/#
https://www.kaggle.com/brijbhushannanda1979/bigmart-sales-data/kernels

In [26]:
import pandas as pd

# Data exports Inde

In [36]:
Export_2014 = pd.read_excel('inde/PC_Export_2014_2015.xlsx')
Export_2014['Year'] = 2014
Export_2015 = pd.read_excel('inde/PC_Export_2015_2016.xlsx')
Export_2015['Year'] = 2015
Export_2016 = pd.read_excel('inde/PC_Export_2016_2017.xlsx')
Export_2016['Year'] = 2016

In [37]:
data = pd.concat([Export_2014, Export_2015, Export_2016])
data.head()

,pc_code,pc_description,unit,country_code,country_name,quantity,value,Year
0,99,Other Commodities,Na,599,Unspecified,NaN,371.280801,2014
1,99,Other Commodities,Na,1213,Kenya,NaN,18.251164,2014
2,99,Other Commodities,Na,1395,Tanzania Rep,NaN,21.844100,2014
3,99,Other Commodities,Na,1417,Uganda,NaN,8.034605,2014
4,99,Other Commodities,Na,2035,Benin,NaN,1.812666,2014

In [34]:
data.shape

(62445, 7)

In [35]:
data.isna().sum()

pc_code               0
pc_description        0
unit                  0
country_code          0
country_name          0
quantity          32464
value                 0
dtype: int64

# Data commerce animaux

In [46]:
import dask.dataframe as dd
data2 = dd.read_csv('/animal/full_database/trade_db_*.csv')
data2.head()

,Year,App.,Taxon,Class,Order,Family,Genus,Importer,Exporter,Origin,Importer reported quantity,Exporter reported quantity,Term,Unit,Purpose,Source
0,2008,I,Balaenidae spp.,Mammalia,Cetacea,Balaenidae,NaN,US,CA,US,1.0,NaN,bones,NaN,H,W
1,2008,I,Addax nasomaculatus,Mammalia,Artiodactyla,Bovidae,Addax,FR,US,NaN,NaN,1.0,trophies,NaN,H,F
2,2008,I,Addax nasomaculatus,Mammalia,Artiodactyla,Bovidae,Addax,FR,ZA,NaN,NaN,1.0,trophies,NaN,H,F
3,2008,I,Addax nasomaculatus,Mammalia,Artiodactyla,Bovidae,Addax,NO,US,NaN,1.0,1.0,trophies,NaN,H,F
4,2008,I,Capra falconeri,Mammalia,Artiodactyla,Bovidae,Capra,BE,PK,NaN,1.0,1.0,trophies,NaN,H,W

In [47]:
data2.shape

(38832, 16)

In [49]:
data2.isna().sum()

Year                              0
App.                              0
Taxon                             0
Class                            15
Order                            12
Family                           15
Genus                            27
Importer                        183
Exporter                       3887
Origin                        33727
Importer reported quantity    18601
Exporter reported quantity    11605
Term                              0
Unit                          38471
Purpose                           0
Source                          148
dtype: int64